코드1)
text = ['  + -- + - + - ',
        ' + --- + - + ',
        '+ -- + - + - ',
        '+ - + - + - + ']

for i in text:
 print(text)

출력결과)
['  + -- + - + - ', ' + --- + - + ', '+ -- + - + - ', '+ - + - + - + ']
['  + -- + - + - ', ' + --- + - + ', '+ -- + - + - ', '+ - + - + - + ']
['  + -- + - + - ', ' + --- + - + ', '+ -- + - + - ', '+ - + - + - + ']
['  + -- + - + - ', ' + --- + - + ', '+ -- + - + - ', '+ - + - + - + ']

코드2)
text = ['  + -- + - + - ',
        ' + --- + - + ',
        '+ -- + - + - ',
        '+ - + - + - + ']
print(text)

출력결과)
['  + -- + - + - ', ' + --- + - + ', '+ -- + - + - ', '+ - + - + - + ']

코드3)
text = ['  + -- + - + - ',
        ' + --- + - + ',
        '+ -- + - + - ',
        '+ - + - + - + ']

for i in text:
 print(i)

출력결과)
 + -- + - + - 
 + --- + - + 
+ -- + - + - 
+ - + - + - + 

코드4)
text = ['  + -- + - + - ',
        ' + --- + - + ',
        '+ -- + - + - ',
        '+ - + - + - + ']

for i in text:
 print(i.strip())

출력결과)
+ -- + - + -
+ --- + - +
+ -- + - + -
+ - + - + - +

코드5)
text = ['  + -- + - + - ',
        ' + --- + - + ',
        '+ -- + - + - ',
        '+ - + - + - + ']

for i in text:
 print(i.strip().replace(' ', ''))

출력결과)
+--+-+-
+---+-+
+--+-+-
+-+-+-+

코드6)
text = ['  + -- + - + - ',
        ' + --- + - + ',
        '+ -- + - + - ',
        '+ - + - + - + ']

for i in text:
 print(i.strip().replace(' ', '').replace('+', '1').replace('-', '0'))

출력결과)
1001010
1000101
1001010
1010101

코드7)
text = ['  + -- + - + - ',
        ' + --- + - + ',
        '+ -- + - + - ',
        '+ - + - + - + ']

for i in text:
 print(int(i.strip().replace(' ', '').replace('+', '1').replace('-', '0'),2))

출력결과)
74
69
74
85

코드8)
text = ['  + -- + - + - ',
        ' + --- + - + ',
        '+ -- + - + - ',
        '+ - + - + - + ']

for i in text:
 print(chr(int(i.strip().replace(' ', '').replace('+', '1').replace('-', '0'),2)))

출력결과)
J
E
J
U

코드9)
text = ['  + -- + - + - ',
        ' + --- + - + ',
        '+ -- + - + - ',
        '+ - + - + - + ']
l = []

for i in text:
 l.append(chr(int(i.strip().replace(' ', '').replace('+', '1').replace('-', '0'),2)))

print(l)

출력결과)
['J', 'E', 'J', 'U']

알게된 점))
1. l.strip, r.strip 은 왼/오 공백인데, 아예 양쪽 공백을 없애기 위해 strip()을 사용함
2.
